{
  "casinoGames": [
    {
      "id": 1,
      "title": "[🦑SKY SQUID] Squid Game X",
      "description": "🌟NEW CODE🌟\n\"$750K$\"\nNext big code at 1M likes! 👍\n\nSEASON 3 !!!\n🚨UPDATE🚨\n-NEW GAMEMODE SKY SQUID\n-NEW GAMEMODE HIDE AND SEEK / KEYS AND KNIVES\n-NEW GAMEMODE JUMP ROPE\n\nWe are a small development group please support us by 👍 the game!\n\nJoin our group to get the FAN tag in game!\n\nCurrent Game Modes:\nRed Light, Green Light\nHoneycomb\nPentathlon\nHide & Seek (Keys & Knives) (NEW)\nJump Rope (NEW)\nSky Squid (NEW)\nMingle\nNight Brawl\nRebellion\nTug of War \nMarbles\nRock, Paper, Scissors Minus One\nGlass Bridge\nSquid Game",
      "image": "https://tr.rbxcdn.com/180DAY-075c464f391ed877bf7467ab20322735/768/432/Image/Webp/noFilter",
      "cover": "",
      "rating": "4.1",
      "action": "https://www.roblox.com/games/7554888362/SKY-SQUID-Squid-Game-X",
      "price": "67$"
    },
    {
      "id": 2,
      "title": "Blox Fruits",
      "description": "⭐Three new reworked fruits⭐☄️Gravity, 🔮Creation, and🪽Eagle! PLUS! New hidden abilities...\nWelcome to Blox Fruits! Become a master swordsman or a powerful blox fruit user as you train to become the strongest player to ever live. You can choose to fight against tough enemies or have powerful boss battles while sailing across the ocean to find hidden secrets.\n\nCurrent level cap: 2650\nCurrent fruits in the game:\nRocket, Spin, Blade, Spring, Bomb, Smoke, Spike, Flame, Ice, Sand, Dark, Eagle, Diamond, Light, Rubber, Ghost, Magma, Quake, Buddha, Love, Creation, Spider, Sound, Phoenix, Portal, Rumble, Pain, Blizzard, Gravity, Mammoth, T-Rex, Dough, Shadow, Venom, Control, Gas, Spirit, Leopard, Yeti, Kitsune, and Dragon\n\nFAQ:\n-Fruits spawn in the map every hour / despawn after 20 mins\n-You can buy fruits from the Blox Fruits Dealer. He restocks random fruits every 4 hours\n-More info in the group description\n\nDo not exploit, our auto-detection will catch you and we do not appeal our bans.",
      "image": "https://tr.rbxcdn.com/180DAY-e1ce51abae5188805c3fee78ec7f4d08/768/432/Image/Webp/noFilter",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.7",
      "action": "https://www.roblox.com/games/2753915549/Blox-Fruits",
      "price": "29$"
    },
    {
      "id": 3,
      "title": "Ink Game",
      "description": "🦑 Survive deadly challenges inspired by Squid Game.\n🏆 Be the last one standing or rebel and escape with all your friends.\n🎭 [2 ENDINGS] [REBEL & FINAL FIGHT]\n\n💻📱🎮 Works on all devices: PC, Console, Mobile.\n\nPC Keybinds:\nLeft Ctrl / Left Alt — Shift Lock\nQ — Dash (if unlocked)\n\n⚠️ CHEATERS WILL BE PERMANENTLY BANNED WITH NO HESITATION, DO NOT CHEAT OR YOU WILL BE BANNED. ⚠️\n\nMade by some HBG devs.\n[Powers are still a work in progress.]",
      "image": "https://tr.rbxcdn.com/180DAY-eeb754830041c5f9ddfd168242949f14/768/432/Image/Webp/noFilter",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.6",
      "action": "https://www.roblox.com/games/99567941238278/Ink-Game",
      "price": "54$"
    },
    {
      "id": 4,
      "title": "BARRY'S PRISON RUN! (OBBY)",
      "description": "Test your luck and skill in Blackjack, the world’s most iconic casino card game! Also known as 21, your goal is simple: beat the dealer by getting a hand total closer to 21 without going over. Will you stand, hit, double down, or split your way to victory? With fast-paced rounds, strategic decisions, and thrilling wins, Blackjack delivers a true Vegas experience right at your fingertips.",
      "image": "https://tr.rbxcdn.com/180DAY-39802c7247d789157f90a1b9ae671cf7/768/432/Image/Webp/noFilter",
      "cover": "/images/desert-rally.jpg",
      "rating": "5.0",
      "action": "https://www.roblox.com/games/8712817601/BARRYS-PRISON-RUN-OBBY",
      "price": "31$"
    },
    {
      "id": 5,
      "title": "Escape The Carnival of Terror Obby!",
      "description": "Looks like we have been locked in a Abandoned Carnival by an EVIL CLOWN! We must find a way to ESCAPE!\n\nTravel though the Carnival and avoid the Traps and Obstacles that get in your way. Hop onto the Rides and RollerCoaster to get to next area. Escape a CRAZY Funhouse and watch out for the EVIL CLOWN! (WARNING MILD JUMPSCARES)\n\nOver 25 challenging Obstacles to beat, CAN YOU ESCAPE THE CARNIVAL OF TERROR?\n\nPlease Leave a Like and Favourite if you enjoy my games. That would really help out a lot :)",
      "image": "https://tr.rbxcdn.com/180DAY-2803401c26b9234c1066b1653ecbcd0f/768/432/Image/Webp/noFilter",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.9",
      "action": "https://www.roblox.com/games/6153766069/Escape-The-Carnival-of-Terror-Obby",
      "price": "62$"
    },
    {
      "id": 6,
      "title": "[🏁] RIVALS",
      "description": "Welcome to RIVALS, the most intense first person shooter game on Roblox! Challenge other players in 1v1 to 5v5 FPS duels where the first to 5 wins.\n\n🎉 UPDATE 13 - The MASSIVE Gamemodes Update is here! Brand new gamemodes will be releasing WEEKLY for the rest of the summer! 🕹️🎉\n\n🔫 Challenge someone by stepping on a duel pad!\n🔑 Earn keys to unlock new weapons & skins!\n📜 Complete contracts to unlock exclusive rewards!\n🏆 Show off your win streak and climb the leaderboards! \n\n🎮 Available on Desktop, Phones, Tablets, XBOX, & PlayStation 5\n💜 Like and Join the group for an exclusive reward!\n\n⚠️ WARNING: Cheaters will be permanently banned with no second chances, our anti-cheat & moderators will catch you. Farming for wins using friends/alts is also not allowed!",
      "image": "https://tr.rbxcdn.com/180DAY-2ec29a8660beb04ec00eabd55f2d7de6/768/432/Image/Webp/noFilter",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.2",
      "action": "https://www.roblox.com/games/17625359962/RIVALS",
      "price": "48$"
    },
    {
      "id": 7,
      "title": "🧗Climb and Jump Tower[World11-Mount Everest]",
      "description": "Welcome to Climb and Jump Tower!\n\nIn this thrilling game, you and your friends will tackle daring heights, scaling iconic landmarks like the Eiffel Tower, Statue of Liberty, Leaning Tower of Pisa, and the Pyramids.\n\nHow to Play:\n\n🧗Climb Challenges🧗\n💰Collect Coins💰\n🐦Unlock Wings🐦\n\nNew code: EVEREST\n\nJoin our group and like our game, please!",
      "image": "https://tr.rbxcdn.com/180DAY-6fd36e45ee91148e78fab57b454389db/768/432/Image/Webp/noFilter",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.6",
      "action": "https://www.roblox.com/games/123921593837160/Climb-and-Jump-Tower-World11-Mount-Everest",
      "price": "71$"
    },
    {
      "id": 8,
      "title": "The Strongest Battlegrounds",
      "description": "Train & fight others to be the strongest.\n\n📱💻🎮 You can play on any device. (CONSOLE, PC, MOBILE)\n⭐ Please consider liking and favoriting the game for more updates.\n\n🖥️ Controls\nG - ultimate mode\nF - block\nQ - dash\nQ (while ragdolled) - ragdoll cancel/evasive\nDouble Tap W - run\nLeft Click - punch\nB - emote wheel\n\n🏆 \"Best Fighting Experience\" Innovation Awards '24.",
      "image": "https://tr.rbxcdn.com/180DAY-ccd8bcf9f66dc37834534d2cb3cfd1b9/768/432/Image/Webp/noFilter",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.6",
      "action": "https://www.roblox.com/games/10449761463/The-Strongest-Battlegrounds",
      "price": "39$"
    },
    {
      "id": 9,
      "title": "99 Nights in the Forest 🔦 [🛠️ CRAFTING]",
      "description": "Build a camp with friends. ⛺\n\nSomething is watching you.\n\n🛠️ CRAFTING UPDATE 🌿\n25/07\n- Gem of the Forest, combine 4 pieces to craft top-tier structures\n- New Crafting Tier, build powerful new end game structures (new craftable mid and early game structures too!) \n- New Crops, grow a fresh assortment of produce in your allotments\n- 2 New Classes: Blacksmith & Farmer.",
      "image": "https://tr.rbxcdn.com/180DAY-643b9b9285f3bd9b63cf392db12a4d87/768/432/Image/Webp/noFilter",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.6",
      "action": "https://www.roblox.com/games/79546208627805/99-Nights-in-the-Forest-CRAFTING",
      "price": "43$"
    },
    {
      "id": 9,
      "title": "Murder Mystery 2",
      "description": "Can you solve the Mystery and survive each round? INNOCENTS: Run and hide from the Murderer. Use your detective skills to expose the Murderer. SHERIFF: Work with the Innocents; you are the only one with a weapon who can take down the Murderer. MURDERER: Eliminate EVERYONE. Don't get shot by the sheriff.Collect and trade hundreds of knives! Check out my profile for quick links to my pages! Like, follow, and subscribe for exclusive update news, free knife codes, and more!",
      "image": "https://tr.rbxcdn.com/180DAY-c929c9ba9069190914f60bbfe47b6cb9/768/432/Image/Webp/noFilter",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.6",
      "action": "https://www.roblox.com/games/79546208627805/99-Nights-in-the-Forest-CRAFTING",
      "price": "56$"
    }
  ],

  "casinoSlots": [
    {
      "id": 1,
      "title": "Black Jack",
      "description": "Test your luck and skill in Blackjack, the world’s most iconic casino card game! Also known as 21, your goal is simple: beat the dealer by getting a hand total closer to 21 without going over. Will you stand, hit, double down, or split your way to victory? With fast-paced rounds, strategic decisions, and thrilling wins, Blackjack delivers a true Vegas experience right at your fingertips.",
      "image": "https://warmageddon.online/games-banner/1715717580.BlackJack21.jpg",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.9",
      "action": "https://warmageddon.online/demo-play/blackjack21",
      "price": "79$"
    },
    {
      "id": 2,
      "title": "Pyramid Infinity War",
      "description": "Step into the high-stakes world of Pyramid: Infinity Wars, where ancient pharaohs meet futuristic fortune! This is no ordinary slot game—it's a thrilling gambling adventure set inside a mystical pyramid where every spin, deal, and bet can unlock cosmic riches or awaken ancient curses. Wager your fate in themed mini-games, treasure slots, and time-warp blackjack tables. Collect relics, climb the pyramid’s chambers, and trigger Infinity Spins to win massive jackpots. Will you walk away a legend, or become a myth lost in the sands of time? The gods are watching. Bet wisely.",
      "image": "https://warmageddon.online/games-banner/1715717640.Pyramid%20Infinity%20Slots.jpg",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.2",
      "action": "https://warmageddon.online/demo-play/pyramid-infinity-slots",
      "price": "35$"
    },
    {
      "id": 3,
      "title": "Bingo",
      "description": "It’s not your grandma’s bingo anymore! Step into the electrifying world of Bingo, where fast-paced numbers meet high-stakes thrills. Daub your way to victory in real-time rounds, unlock power-ups, and rake in jackpot coins as the tension builds with every call.",
      "image": "https://warmageddon.online/games-banner/1715717718.bingo.jpg",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.1",
      "action": "https://warmageddon.online/demo-play/bingo",
      "price": "50$"
    },
    {
      "id": 4,
      "title": "Dubai Dreams",
      "description": "Welcome to Dubai Dreams, where the skyline shimmers, the stakes are sky-high, and every spin feels like a billionaire’s bet. Step into a world of gold-plated reels, exotic bonuses, and high-roller vibes as you chase your fortune under the desert lights.",
      "image": "https://warmageddon.online/games-banner/1710377602.Dubai%20Dreams.jpg",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.5",
      "action": "https://warmageddon.online/demo-play/dubai-dreams",
      "price": "41$"
    },
    {
      "id": 5,
      "title": "Gem Slots",
      "description": "Spin through a world of glittering riches in Gem Slots, the ultimate jewel-themed slot experience! Match radiant rubies, dazzling diamonds, and shimmering sapphires for explosive wins and bonus rounds that shine brighter than gold. With every pull of the reel, unlock sparkling jackpots, gemstone multipliers, and rare wilds that can turn your luck into a treasure trove. Whether you're chasing combos or hitting mega spins, Gem Slots is pure luxury in every play.",
      "image": "https://warmageddon.online/games-banner/1710377533.thumbnail.jpg",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.3",
      "action": "https://warmageddon.online/demo-play/gems-slots",
      "price": "73$"
    },
    {
      "id": 6,
      "title": "Lab Slots",
      "description": "Enter the lab where luck meets lightning! In Lab Slots, every spin is an experiment in pure jackpot energy. Watch wild chemicals bubble, radioactive reels spin, and electrifying bonuses explode as you chase your next big win. Mix volatile potions, trigger chain reactions, and unlock the Mad Scientist Bonus Round for insane multipliers and mutated jackpots. This isn’t just gambling — it’s a high-voltage casino experiment gone wild!",
      "image": "https://warmageddon.online/games-banner/1709751187.Lab%20Slots.jpg",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.8",
      "action": "https://warmageddon.online/demo-play/lab-slots",
      "price": "68$"
    },
    {
      "id": 7,
      "title": "Tripple Cash Slots",
      "description": "Get ready to triple your excitement, triple your spins, and triple your winnings in Triple Cash Slots! This is the ultimate money-themed slot game where cash is king, and the reels never stop raining rewards. Hit blazing hot combos, unlock Triple Bonus Rounds, and chase mega jackpots stacked with coins, bills, and pure gold. With every spin, you’re one step closer to becoming a virtual millionaire. Three times the cash. Three times the thrill. One shot to win it all.",
      "image": "https://warmageddon.online/games-banner/1709402988.Triple%20Cash%20Slots.jpg",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.7",
      "action": "https://warmageddon.online/demo-play/triple-cash-slots",
      "price": "24$"
    },
    {
      "id": 8,
      "title": "Top Dog Slots",
      "description": "Step into the VIP lounge of slots with Top Dog Slots, where only the boldest, richest, and luckiest rise to the top! Spin the reels in a world of blinged-out bulldogs, luxury bones, golden collars, and outrageous jackpots. Every spin puts you one paw closer to massive wins, epic bonus rounds, and elite Top Dog status. With animated pups, wild reels, and nonstop bling, it’s all about living large and winning larger.",
      "image": "https://warmageddon.online/games-banner/1709402942.Top%20Dog%20Slots.jpg",
      "cover": "/images/desert-rally.jpg",
      "rating": "5.0",
      "action": "https://warmageddon.online/demo-play/top-dog-slots",
      "price": "59$"
    },
    {
      "id": 9,
      "title": "Endless Summer Slots",
      "description": "Feel the heat and ride the waves of luck in Endless Summer Slots! Escape to a paradise of spinning reels, tropical vibes, and blazing-hot jackpots. Whether you're chilling under palm trees or surfing through bonus rounds, the summer never ends when you're winning big. Hit sunny wilds, tropical multipliers, and unlock the Beach Party Bonus for waves of rewards and endless thrills. No sunscreen needed — just spin, relax, and let the coins roll in.",
      "image": "https://warmageddon.online/games-banner/1709402876.Summer%20Slots.jpg",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.6",
      "action": "https://warmageddon.online/demo-play/summer-slots",
      "price": "33$"
    },
    {
      "id": 10,
      "title": "Suggar Candy",
      "description": "Welcome to Sugar Candy Slots, where every spin is a sugar rush of fun, flavor, and fortune! Dive into a world of juicy jackpots, gummy wilds, and candy-coated reels bursting with sweet rewards. Spin lollipops, chocolate coins, and rainbow candies to unlock bonus rounds and delicious multipliers. The more you play, the sweeter the wins — but watch out, the sugar high can be addictive!",
      "image": "https://warmageddon.online/games-banner/1709402581.Sugar%20Candy%20Slots.jpg",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.6",
      "action": "https://warmageddon.online/demo-play/sugar-candy-slots",
      "price": "75$"
    },
    {
      "id": 11,
      "title": "Sea Hunter",
      "description": "Dive into the depths of fortune with Sea Hunter Slots, where ocean legends, treasure chests, and underwater cannons await! Spin the reels among glowing sea creatures, ancient ruins, and explosive bonus features lurking beneath the waves. Charge up the cannon meter, unleash wild transformations, and blast your way to sunken jackpots. With every spin, the deep sea reveals new surprises — and only the boldest hunters claim the treasure.",
      "image": "https://warmageddon.online/games-banner/1709402318.Sea%20Hunter.jpg",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.6",
      "action": "https://warmageddon.online/demo-play/sea-hunter",
      "price": "49$"
    },
    {
      "id": 12,
      "title": "Royal diamond",
      "description": "Royal Diamond is a luxurious slot machine game set in a world of glittering jewels, golden crowns, and royal treasures. The game features high-quality graphics with dazzling diamonds, rubies, emeralds, and symbols of royalty like golden thrones and scepters. With 5 reels and multiple paylines, players spin the reels in hopes of landing matching symbols and unlocking bonus features like Free Spins, Wilds, and a Royal Jackpot. The more diamonds you collect, the closer you get to unlocking the riches of the kingdom. Ideal for players who enjoy high-stakes slots with a touch of royalty and elegance.",
      "image": "https://warmageddon.online/games-banner/1709402205.Royal%20Diamond%20Slots.jpg",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.6",
      "action": "https://warmageddon.online/demo-play/royal-diamond-slots",
      "price": "22$"
    },
    {
      "id": 13,
      "title": "Penguins Slot",
      "description": "Penguins Slot is a fun and frosty slot machine adventure set in the icy Arctic, starring adorable penguins and chilly surprises. With 5 reels and multiple paylines, players spin to match cute penguin symbols, snowballs, fish, igloos, and more. The game features exciting bonuses like Ice Wilds, Freezing Free Spins, and a Snowstorm Bonus Round where you can win big! The playful animations and cheerful soundtrack make it perfect for casual players looking for light-hearted, yet rewarding slot action in a snowy wonderland.",
      "image": "https://warmageddon.online/games-banner/1709241434.Penguins%20Slots.jpg",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.6",
      "action": "https://warmageddon.online/demo-play/penguins-slots",
      "price": "64$"
    }
  ],

  "casinos": [
    {
      "id": 1,
      "title": "Warmageddon",
      "description": "Based on available information, “Warmageddon” is likely not a legitimate online gambling or slots site. It’s best to avoid any interaction or transactions with this domain, as there are high risks related to trust, security, and legality.If you’re looking for reliable online casino or slot platforms, I can help point you toward licensed and well-reviewed options. Just let me know what type of games you're interested in (like slots, blackjack, or something else), and I’ll guide you toward safe and reputable sites.",
      "image": "https://warmageddon.online/frontend/landing/images/bannerbg1.jpg",
      "cover": "/images/desert-rally.jpg",
      "rating": "4.9",
      "action": "https://warmageddon.online/demo-play/blackjack21",
      "price": "79$",
      "gamesApi": "https://snurr.casino/warmageddon/api/allgames"   
    }
  ]
}